/* 
* upto 100: --> 100
* more than 101-200: ---> 90
* more than 200: --> 700
*/
function discountedPrice(quantity){
    if(quantity <= 100){
        const total = quantity * 100;
        return total;
    }
    else if(quantity <= 200){
        const total = quantity *90;
        return total;
    }
    else{
        const total = quantity* 70;
        return total;
    }
}
const total = discountedPrice(50);
console.log(total);



//----------Multi-layer discount price calculation-------

/* 
* first100 -->100
*101To200 --> 90
* above 200 -->
*/
function layeredDiscountedTotal (quantity){
    const first100Price = 100;
    const second100Price = 90;
    const above200Price = 70;

    if(quantity <= 100){
        const total = quantity * first100Price;
        return total;
    }
    else if (quantity <= 200){
        const first100Total = 100 * first100Price;
        const ramainingQuantity = quantity - 100;
        const remainingTotal = ramainingQuantity * second100Price;
        const total = first100Total + remainingTotal;
        return total;
    }
    else{
        const first100Total = 100* first100Price;
        const second100Total = 100* second100Price;
        const remainingQuantity = quantity - 200;
        const ramainingTotal = remainingQuantity * above200Price;
        const total = first100Total+ second100Total + ramainingTotal;

        return total
    }
}
const output = layeredDiscountedTotal(190);
console.log("ans",output);

/* 🛒 বাস্তব উদাহরণ: চালের দোকান

ধরো তুমি চালের দোকান এ গেলি। দোকানদার বলছে:

প্রথম ১০০ কেজি চাল → ১০০ টাকা প্রতি কেজি

১০১–২০০ কেজি → ৯০ টাকা প্রতি কেজি

২০০ কেজির বেশি → ৭০ টাকা প্রতি কেজি

এখন তুমি বিভিন্ন পরিমাণ কিনছো, এবং দোকানদার ধাপে ধাপে হিসাব করছে।

১️⃣ তুমি ৯০ কেজি কিনলে
quantity = 90


কেন:

৯০ ≤ ১০০

তাই সব কেজি = ১০০ টাকা করে

হিসাব:

90 × 100 = 9000 টাকা


দোকানদার বলবে:
“মোট ৯০০০ টাকা দেন”

২️⃣ তুমি ১৫০ কেজি কিনলে
quantity = 150


কেন:

প্রথম ১০০ কেজি → ১০০ টাকা প্রতি কেজি → 100 × 100 = 10000

বাকি ৫০ কেজি → ৯০ টাকা প্রতি কেজি → 50 × 90 = 4500

মোট = 10000 + 4500 = 14500 টাকা

দোকানদার বলবে:
“আপনি বেশি নিচ্ছেন, তাই ডিসকাউন্ট দিলাম, মোট ১৪৫০০ টাকা”

৩️⃣ তুমি ২৫০ কেজি কিনলে
quantity = 250


কেন:

প্রথম ১০০ কেজি → 100 × 100 = 10000

দ্বিতীয় ১০০ কেজি → 100 × 90 = 9000

বাকি ৫০ কেজি → 50 × 70 = 3500

মোট = 10000 + 9000 + 3500 = 22500 টাকা

দোকানদার বলবে:
“বড় অর্ডার, তাই সবচেয়ে কম রেট! মোট ২২৫০০ টাকা”

🔑 মূল ধারণা

প্রথম লেয়ার → দাম বেশি (প্রথম ১০০ কেজি)

দ্বিতীয় লেয়ার → মধ্যম দাম (পরবর্তী ১০০ কেজি)

তৃতীয় লেয়ার → সবচেয়ে কম দাম (২০০-এর পর)

👉 ঠিক এই হিসাবটাই তোমার layeredDiscountedTotal() function করে। */